RT-Thread/rt-thread/bsp/imxrt/libraries/drivers/drv_eth.c
    imxrt_eth_device.RxBuffDescrip = &g_rxBuffDescrip[0];
    imxrt_eth_device.TxBuffDescrip = &g_txBuffDescrip[0];
    imxrt_eth_device.RxDataBuff = &g_rxDataBuff[0];
    imxrt_eth_device.TxDataBuff = &g_txDataBuff[0];

    /* prepare the buffer configuration. */
    // enet_buffer_config_t buffConfig[RING_NUM] =
    //     {
    //         ENET_RXBD_NUM,
    //         ENET_TXBD_NUM,
    //         sizeof(rx_buffer_t),
    //         sizeof(tx_buffer_t),
    //         &imxrt_eth_device.RxBuffDescrip[0],
    //         &imxrt_eth_device.TxBuffDescrip[0],
    //         NULL,
    //         &imxrt_eth_device.TxDataBuff[0][0],
    //         true,
    //         true,
    //         NULL,
    //     };
    buffConfig[0].rxBdNumber = ENET_RXBD_NUM;            /* Receive buffer descriptor number. */
    buffConfig[0].txBdNumber = ENET_TXBD_NUM;            /* Transmit buffer descriptor number. */
    buffConfig[0].rxBuffSizeAlign = sizeof(rx_buffer_t); /* Aligned receive data buffer size. */
    buffConfig[0].txBuffSizeAlign = sizeof(tx_buffer_t); /* Aligned transmit data buffer size. */
    buffConfig[0].rxBdStartAddrAlign =
        &(imxrt_eth_device.RxBuffDescrip[0]); /* Aligned receive buffer descriptor start address. */
    buffConfig[0].txBdStartAddrAlign =
        &(imxrt_eth_device.TxBuffDescrip[0]); /* Aligned transmit buffer descriptor start address. */
    buffConfig[0].rxBufferAlign =
        NULL;                                                           /* Receive data buffer start address. NULL when buffers are allocated by callback for RX zero-copy. */
    buffConfig[0].txBufferAlign = &(imxrt_eth_device.TxDataBuff[0][0]); /* Transmit data buffer start address. */
    buffConfig[0].txFrameInfo = NULL;                                   /* Transmit frame information start address. Set only if using zero-copy transmit. */
    buffConfig[0].rxMaintainEnable = true;                              /* Receive buffer cache maintain. */
    buffConfig[0].txMaintainEnable = true;                              /* Transmit buffer cache maintain. */

    /* Get default configuration. */
    /*
     * config.miiMode = kENET_RmiiMode;
     * config.miiSpeed = kENET_MiiSpeed100M;
     * config.miiDuplex = kENET_MiiFullDuplex;
     * config.rxMaxFrameLen = ENET_FRAME_MAX_FRAMELEN;
     */
    ENET_GetDefaultConfig(&config);
    config.ringNum = ENET_RING_NUM;
    config.miiSpeed = imxrt_eth_device.speed;
    config.miiDuplex = imxrt_eth_device.duplex;
#ifdef PHY_USING_RTL8211F
    config.miiMode = kENET_RgmiiMode;
#else
    config.miiMode = kENET_RmiiMode;
#endif
    config.rxBuffAlloc = _enet_rx_alloc;
    config.rxBuffFree = _enet_rx_free;
    config.userData = &imxrt_eth_device;
    /* Set SMI to get PHY link status. */
#ifdef SOC_IMXRT1170_SERIES
    sysClock = CLOCK_GetRootClockFreq(kCLOCK_Root_Bus);
#else
    sysClock = CLOCK_GetFreq(kCLOCK_AhbClk);
#endif

    // dbg_log(DBG_LOG, "deinit\n");
    // ENET_Deinit(imxrt_eth_device.enet_base);

    config.interrupt |= kENET_TxFrameInterrupt | kENET_RxFrameInterrupt | kENET_TxBufferInterrupt | kENET_LateCollisionInterrupt;
    config.callback = _enet_callback;

    for (i = 0; i < ENET_RXBUFF_NUM; i++)
    {
        imxrt_eth_device.RxPbufs[i].p.custom_free_function = _enet_rx_release;
        imxrt_eth_device.RxPbufs[i].buffer = &(imxrt_eth_device.RxDataBuff[i][0]);
        imxrt_eth_device.RxPbufs[i].buffer_used = false;
    }

    // dbg_log(DBG_LOG, "deinit\n");
    // ENET_Deinit(imxrt_eth_device.enet_base);
    dbg_log(DBG_LOG, "init\n");
    ENET_Init(imxrt_eth_device.enet_base, &imxrt_eth_device.enet_handle, &config, &buffConfig[0], &imxrt_eth_device.dev_addr[0], sysClock);
    // dbg_log(DBG_LOG, "set call back\n");
    // ENET_SetCallback(&imxrt_eth_device.enet_handle, _enet_callback, &imxrt_eth_device);
    dbg_log(DBG_LOG, "active read\n");
    ENET_ActiveRead(imxrt_eth_device.enet_base);
}

#if defined(ETH_RX_DUMP) || defined(ETH_TX_DUMP)
static void packet_dump(const char *msg, const struct pbuf *p)
{
    const struct pbuf *q;
    rt_uint32_t i, j;
    rt_uint8_t *ptr;

    rt_kprintf("%s %d byte\n", msg, p->tot_len);

    i = 0;
    for (q = p; q != RT_NULL; q = q->next)
    {
        ptr = q->payload;

        for (j = 0; j < q->len; j++)
        {
            if ((i % 8) == 0)
            {
                rt_kprintf("  ");
            }
            if ((i % 16) == 0)
            {
                rt_kprintf("\r\n");
            }
            rt_kprintf("%02x ", *ptr);

            i++;
            ptr++;
        }
    }

    rt_kprintf("\n\n");
}
#else
#define packet_dump(...)
#endif /* dump */

/* initialize the interface */
static rt_err_t rt_imxrt_eth_init(rt_device_t dev)
{
    dbg_log(DBG_LOG, "rt_imxrt_eth_init...\n");
    _enet_config();

    return RT_EOK;
}

static rt_err_t rt_imxrt_eth_open(rt_device_t dev, rt_uint16_t oflag)
{
    dbg_log(DBG_LOG, "rt_imxrt_eth_open...\n");
    return RT_EOK;
}

static rt_err_t rt_imxrt_eth_close(rt_device_t dev)
{
    dbg_log(DBG_LOG, "rt_imxrt_eth_close...\n");
    return RT_EOK;
}

static rt_size_t rt_imxrt_eth_read(rt_device_t dev, rt_off_t pos, void *buffer, rt_size_t size)
{
    dbg_log(DBG_LOG, "rt_imxrt_eth_read...\n");
    rt_set_errno(-RT_ENOSYS);
    return 0;
}

static rt_size_t rt_imxrt_eth_write(rt_device_t dev, rt_off_t pos, const void *buffer, rt_size_t size)
{
    dbg_log(DBG_LOG, "rt_imxrt_eth_write...\n");
    rt_set_errno(-RT_ENOSYS);
    return 0;
}

static rt_err_t rt_imxrt_eth_control(rt_device_t dev, int cmd, void *args)
{
    dbg_log(DBG_LOG, "rt_imxrt_eth_control...\n");
    switch (cmd)
    {
    case NIOCTL_GADDR:
        /* get mac address */
        if (args)
            rt_memcpy(args, imxrt_eth_device.dev_addr, 6);
        else
            return -RT_ERROR;
        break;

    default:
        break;
    }

    return RT_EOK;
}

static bool _ENET_TxDirtyRingAvailable(enet_tx_dirty_ring_t *txDirtyRing)
{
    return !txDirtyRing->isFull;
}

static uint16_t _ENET_IncreaseIndex(uint16_t index, uint16_t max)
{
    assert(index < max);

    /* Increase the index. */
    index++;
    if (index >= max)
    {
        index = 0;
    }
    return index;
}

static void _ENET_ActiveSendRing(ENET_Type *base, uint8_t ringId)
{
    assert(ringId < (uint8_t)FSL_FEATURE_ENET_INSTANCE_QUEUEn(base));

    volatile uint32_t *txDesActive = NULL;

    /* Ensure previous data update is completed with Data Synchronization Barrier before activing Tx BD. */
    __DSB();

    switch (ringId)
    {
    case 0:
        txDesActive = &(base->TDAR);
        break;
#if FSL_FEATURE_ENET_QUEUE > 1
    case 1:
        txDesActive = &(base->TDAR1);
        break;
    case 2:
        txDesActive = &(base->TDAR2);
        break;
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
    default:
        txDesActive = &(base->TDAR);
        break;
    }

