RT-Thread/rt-thread/bsp/imxrt/libraries/drivers/drv_eth.c
                        /* Active the transmit buffer descriptor. */
                        _ENET_ActiveSendRing(base, ringId);
                        isReturn = true;
                        break;
                    }
                    /* Update the buffer descriptor address. */
                    curBuffDescrip = txBdRing->txBdBase + txBdRing->txGenIdx;
                } while (0U == (curBuffDescrip->control & ENET_BUFFDESCRIPTOR_TX_READY_MASK));

                if (isReturn == false)
                {
                    result = kStatus_ENET_TxFrameBusy;
                }
            }
        }
    }
    return result;
}

/* ethernet device interface */
/* transmit packet. */
rt_err_t rt_imxrt_eth_tx(rt_device_t dev, struct pbuf *p)
{
    rt_err_t result = RT_EOK;
    enet_handle_t *enet_handle = &imxrt_eth_device.enet_handle;

    RT_ASSERT(p != NULL);
    RT_ASSERT(enet_handle != RT_NULL);

    dbg_log(DBG_LOG, "rt_imxrt_eth_tx: %d\n", p->len);

#ifdef ETH_TX_DUMP
    packet_dump("send", p);
#endif

    do
    {
        result = _ENET_SendFrame(imxrt_eth_device.enet_base, enet_handle, (const uint8_t *)p, p->tot_len, RING_ID, false, NULL);

        if (result == kStatus_ENET_TxFrameBusy)
        {
            imxrt_eth_device.tx_is_waiting = RT_TRUE;
            rt_sem_take(&imxrt_eth_device.tx_wait, RT_WAITING_FOREVER);
        }

    } while (result == kStatus_ENET_TxFrameBusy);

    return RT_EOK;
}

/* reception packet. */
struct pbuf *rt_imxrt_eth_rx(rt_device_t dev)
{
    uint32_t length = 0;
    status_t status;

    struct pbuf *p = RT_NULL;
    enet_handle_t *enet_handle = &imxrt_eth_device.enet_handle;
    ENET_Type *enet_base = imxrt_eth_device.enet_base;
    enet_data_error_stats_t *error_statistic = &imxrt_eth_device.error_statistic;

    /* Get the Frame size */
    status = ENET_GetRxFrameSize(enet_handle, &length, RING_ID);

    /* Call ENET_ReadFrame when there is a received frame. */
    if (length != 0)
    {
        /* Received valid frame. Deliver the rx buffer with the size equal to length. */
        p = pbuf_alloc(PBUF_RAW, length, PBUF_POOL);

        if (p != NULL)
        {
            status = ENET_ReadFrame(enet_base, enet_handle, p->payload, length, RING_ID, NULL);
            if (status == kStatus_Success)
            {
#ifdef ETH_RX_DUMP
                packet_dump("recv", p);
#endif
                return p;
            }
            else
            {
                dbg_log(DBG_LOG, " A frame read failed\n");
                pbuf_free(p);
            }
        }
        else
        {
            dbg_log(DBG_LOG, " pbuf_alloc faild\n");
        }
    }
    else if (status == kStatus_ENET_RxFrameError)
    {
        dbg_log(DBG_LOG, "ENET_GetRxFrameSize: kStatus_ENET_RxFrameError\n");
        /* Update the received buffer when error happened. */
        /* Get the error information of the received g_frame. */
        ENET_GetRxErrBeforeReadFrame(enet_handle, error_statistic, RING_ID);
        /* update the receive buffer. */
        ENET_ReadFrame(enet_base, enet_handle, NULL, 0, RING_ID, NULL);
    }

    ENET_EnableInterrupts(enet_base, kENET_RxFrameInterrupt);
    return NULL;
}

#ifdef BSP_USING_PHY
static void phy_monitor_thread_entry(void *parameter)
{    
    static rt_uint16_t port_1_cur_link_status = RT_FALSE;
    static rt_uint16_t port_2_cur_link_status = RT_FALSE;
    static rt_uint16_t port_1_pre_link_status = RT_FALSE;
    static rt_uint16_t port_2_pre_link_status = RT_FALSE;    
    int status_phy_changed = 0;  
    while (1)
    {
        /* check  port1/2 link status */
        status_phy_changed = 0;
        port_1_cur_link_status = rtl_get_link_status(RTL_PORT_0);
        port_2_cur_link_status = rtl_get_link_status(RTL_PORT_1);
        if(port_1_pre_link_status != port_1_cur_link_status)
        {
            port_1_pre_link_status = port_1_cur_link_status;
            if(port_1_cur_link_status)
            {               
                dbg_log(DBG_INFO,"PHY Port1 Link up\n");
            }
            else
            {
                dbg_log(DBG_INFO,"PHY Port1 Link down\n");
            }
            status_phy_changed = 1;
        }

        if(port_2_pre_link_status != port_2_cur_link_status)
        {
            port_2_pre_link_status = port_2_cur_link_status;
            if(port_2_cur_link_status)
            {                
                dbg_log(DBG_INFO,"PHY Port2 Link up\n");
            }
            else
            {
                dbg_log(DBG_INFO,"PHY Port2 Link down\n");
            }
            status_phy_changed = 1;
        }
        
        if (status_phy_changed == 1)
        {
            eth_device_linkchange(&imxrt_eth_device.parent, port_1_cur_link_status, port_2_cur_link_status);
        } 

        rt_thread_delay(RT_TICK_PER_SECOND * 2);
    }
}

#endif

static void rt_imxrt_enet_phy_reset_by_gpio(void)
{
    gpio_pin_config_t gpio_config = {kGPIO_DigitalOutput, 0, kGPIO_NoIntmode};
    GPIO_PinInit(GPIO3, BSP_USING_PHY_RST_PIN, &gpio_config);
    GPIO_PinInit(GPIO3, BSP_USING_ETH_INT_PIN, &gpio_config);
    /* pull up the ENET_INT before RESET. */
    GPIO_WritePinOutput(GPIO3, BSP_USING_ETH_INT_PIN, 1);
    GPIO_WritePinOutput(GPIO3, BSP_USING_PHY_RST_PIN, 0);
    rt_thread_delay(100);
    GPIO_WritePinOutput(GPIO3, BSP_USING_PHY_RST_PIN, 1);
}


static int rt_hw_imxrt_eth_init(void)
{
    rt_err_t state;

    _enet_clk_init();

    /* Set PHY */
    rt_imxrt_enet_phy_reset_by_gpio();
    if (RT_EOK == rtl_init(ETH_SWITCH))
    {       
        rt_kprintf("init rtl8304 success\r\n");
    }
    else
    {
        rt_kprintf("try init rtl8304 failed\r\n");
    }

#ifndef PHY_USING_RTL8304
    /* NXP (Freescale) MAC OUI */
    imxrt_eth_device.dev_addr[0] = 0x54;
    imxrt_eth_device.dev_addr[1] = 0x27;
    imxrt_eth_device.dev_addr[2] = 0x8d;
    /* generate MAC addr from 96bit unique ID (only for test). */
    imxrt_eth_device.dev_addr[3] = 0x11;
    imxrt_eth_device.dev_addr[4] = 0x22;
    imxrt_eth_device.dev_addr[5] = 0x33;

